1. 데이터를 저장 후 몇 가지 문제를 코드로 작성합니다.

In [3]:
import pandas as pd

In [4]:
# 01) 데이터를 저장해 주세요
data = {'이름':['메로나','비비빅','죠스바'],'가격':[300,400,250],'재고':[20,3,100]}

In [5]:
# 02) 데이터 저장 후 주요 속성 6가지를 출력하세요.
dataDF=pd.DataFrame(data)
dataDF
print(dataDF.index,dataDF.columns,dataDF.values,dataDF.ndim,dataDF.shape,dataDF.dtypes,sep='\n\n')

RangeIndex(start=0, stop=3, step=1)

Index(['이름', '가격', '재고'], dtype='object')

[['메로나' 300 20]
 ['비비빅' 400 3]
 ['죠스바' 250 100]]

2

(3, 3)

이름    object
가격     int64
재고     int64
dtype: object

In [6]:
# 03) 가격 데이터만 추출하세요
dataDF['가격']

0    300
1    400
2    250
Name: 가격, dtype: int64

In [7]:
# 04) 이름과 재고 데이터를 추출하세요.
dataDF[['가격','재고']]

    가격   재고
0  300   20
1  400    3
2  250  100

In [8]:
# 05) 비비빅의 가격과 재고 데이터를 추출 하세요.
dataDF.loc[1]

이름    비비빅
가격    400
재고      3
Name: 1, dtype: object

In [9]:
# 06) 메로나와 죠스바의 가격, 재고 데이터를 추출 하세요
dataDF.iloc[[0,2]]

    이름   가격   재고
0  메로나  300   20
2  죠스바  250  100

In [10]:
# 07) 행 인덱스를 ‘일’, ‘이’, ‘삼’으로 변경해 주세요.

In [11]:
dataDF.index = ['일', '이', '삼']
dataDF

    이름   가격   재고
일  메로나  300   20
이  비비빅  400    3
삼  죠스바  250  100

In [12]:
# 08) 총가격 컬럼을 추가 후 0으로 값을 채워 주세요.
dataDF['총가격'] = 0
dataDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0

In [13]:
# 09) ‘빵빠레’, 550원, 10개 데이터를 추가해 주세요.
dataDF.loc['사'] = ['빵빠레',550,10,0]
dataDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400    3    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

In [14]:
# 10) 비비빅의 재고를 23로 변경해 주세요.
dataDF.loc['이','재고'] = 23
dataDF

    이름   가격   재고  총가격
일  메로나  300   20    0
이  비비빅  400   23    0
삼  죠스바  250  100    0
사  빵빠레  550   10    0

2. OHLC(Open/High/Low/Close) 가격정보 데이터입니다.

In [15]:
# 01) 데이터를 저장해 주세요. 
data2 =  [[2000, 3050, 2050, 1980], [7500, 2050, 2050, 1980], [15450, 15050, 15550, 14900]]
d_DF = pd.DataFrame(data2,columns=['시가','고가','저가','종가'])
d_DF

      시가     고가     저가     종가
0   2000   3050   2050   1980
1   7500   2050   2050   1980
2  15450  15050  15550  14900

In [16]:
# 02) 데이터 저장 후 주요 속성 6가지를 출력하세요.
print(d_DF.index,d_DF.columns,d_DF.values,d_DF.ndim,d_DF.shape,d_DF.dtypes,sep='\n\n')

RangeIndex(start=0, stop=3, step=1)

Index(['시가', '고가', '저가', '종가'], dtype='object')

[[ 2000  3050  2050  1980]
 [ 7500  2050  2050  1980]
 [15450 15050 15550 14900]]

2

(3, 4)

시가    int64
고가    int64
저가    int64
종가    int64
dtype: object

In [17]:
# 03) 행 인덱스를 2024-01-01, 2024-02-01, 2024-03-01 데이터로 변경해 주세요.
d_DF.index = ['2024-01-01', '2024-02-01', '2024-03-01']
d_DF

               시가     고가     저가     종가
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [18]:
# 04) 열 인덱스를 Open/High/Low/Close로 변경해 주세요.
d_DF.columns = ['Open','High','Low','Close']
d_DF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900

In [19]:
# 05) 2024-02-01의 High, Close 데이터를 추출 하세요.
d_DF.loc['2024-02-01',['High','Close']]

High     2050
Close    1980
Name: 2024-02-01, dtype: int64

In [20]:
# 06) 2024-04-01의 3200, 3550, 3000, 2990 데이터를 추가해 주세요.
d_DF.loc['2024-04-01']= [3200, 3550, 3000, 2990]
d_DF

             Open   High    Low  Close
2024-01-01   2000   3050   2050   1980
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [21]:
# 07) 2024-01-01 데이터를 삭제해 주세요.
d_DF.drop(index='2024-01-01',inplace=True)
d_DF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  15550  14900
2024-04-01   3200   3550   3000   2990

In [22]:
# 08) 2024-03-01의 Low값을 14000으로 변경해 주세요
d_DF.iloc[1,2] = 14000
d_DF

             Open   High    Low  Close
2024-02-01   7500   2050   2050   1980
2024-03-01  15450  15050  14000  14900
2024-04-01   3200   3550   3000   2990

In [23]:
# 09) Average 컬럼을 추가 후 0으로 값을 채워 주세요.
d_DF['Average'] = 0
d_DF

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0

In [24]:
# 10) Total행을 추가 후 0으로 값을 채워 주세요.
d_DF.loc['Total'] = 0
d_DF

             Open   High    Low  Close  Average
2024-02-01   7500   2050   2050   1980        0
2024-03-01  15450  15050  14000  14900        0
2024-04-01   3200   3550   3000   2990        0
Total           0      0      0      0        0

3. 아래 단답형 문제에 답해주세요.

In [25]:
''' 
(3-01) 판다스는 ( )를 분석하기 위한 패키지입니다.           
데이터

(3-02) 판다스에서는 다양한 종류의 데이터를 ( )형태로 저장합니다. 
데이터프레임

(3-03) 판다스에서는 1차원 데이터를 저장하는 자료구조를 ( )라고 합니다. 
시리즈 Series

(3-04) 판다스에서는 2차원 데이터를 저장하는 자료구조를 ( )라고 합니다. 
데이터프레임 DataFrame

(3-05) 판다스는 내부적으로 데이터를 ( )형태로 저장합니다. 
행렬,표  ===> Array

(3-06) 판다스에서는 1개 열/column 추출 시 자료구조는 ( )입니다. 
시리즈

(3-07) 판다스에서는 1개 행/row 추출 시 자료구조는 ( )입니다. 
시리즈

(3-08) 판다스에서는 2개 이상 열/column 또는 행/row 추출 시 자료구조는 ( )입니다.
데이터프레임
'''

' \n(3-01) 판다스는 ( )를 분석하기 위한 패키지입니다.           \n데이터\n\n(3-02) 판다스에서는 다양한 종류의 데이터를 ( )형태로 저장합니다. \n데이터프레임\n\n(3-03) 판다스에서는 1차원 데이터를 저장하는 자료구조를 ( )라고 합니다. \n시리즈 Series\n\n(3-04) 판다스에서는 2차원 데이터를 저장하는 자료구조를 ( )라고 합니다. \n데이터프레임 DataFrame\n\n(3-05) 판다스는 내부적으로 데이터를 ( )형태로 저장합니다. \n행렬,표  ===> Array\n\n(3-06) 판다스에서는 1개 열/column 추출 시 자료구조는 ( )입니다. \n시리즈\n\n(3-07) 판다스에서는 1개 행/row 추출 시 자료구조는 ( )입니다. \n시리즈\n\n(3-08) 판다스에서는 2개 이상 열/column 또는 행/row 추출 시 자료구조는 ( )입니다.\n데이터프레임\n'